name: "craft"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ -1, 3, -1, -1 ]
  }
]
output [
  {
    # Boxes + links
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1, 2 ]
  },
  {
    # Refine feature
    name: "output1"
    data_type: TYPE_FP32
    dims: [ -1, 32, -1, -1 ]
  }
]