name: "generator"
platform: "pytorch_libtorch"
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ -1, 100, 1, 1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1, 1 , 28, 28]
  }
]