name: "yamnet"
platform: "tensorflow_savedmodel"
input [
  {
    name: "waveform"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    # scores
    name: "output_0"
    data_type: TYPE_FP32
    dims: [ -1, 521 ]
  },
  {
    # embeddings
    name: "output_1"
    data_type: TYPE_FP32
    dims: [ -1, 1024 ]
  },
  {
    # log_mel_spectrogram
    name: "output_2"
    data_type: TYPE_FP32
    dims: [ -1, 64 ]
  }
]